apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_rtc_io.h
/****************************************************************************
 * arch/xtensa/src/esp32/hardware/esp32_rtc_io.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_XTENSA_SRC_ESP32_HARDWARE_ESP32_RTC_IO_H
#define __ARCH_XTENSA_SRC_ESP32_HARDWARE_ESP32_RTC_IO_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "esp32_soc.h"

#define RTC_GPIO_OUT_REG          (DR_REG_RTCIO_BASE + 0x0)

/* RTC_GPIO_OUT_DATA : R/W ;bitpos:[31:14] ;default: 0 ; */

/* description: GPIO0~17 output value */

#define RTC_GPIO_OUT_DATA         0x0003ffff
#define RTC_GPIO_OUT_DATA_M       ((RTC_GPIO_OUT_DATA_V) << \
                                   (RTC_GPIO_OUT_DATA_S))
#define RTC_GPIO_OUT_DATA_V       0x3ffff
#define RTC_GPIO_OUT_DATA_S       14

#define RTC_GPIO_OUT_W1TS_REG     (DR_REG_RTCIO_BASE + 0x4)

/* RTC_GPIO_OUT_DATA_W1TS : WO ;bitpos:[31:14] ;default: 0 ; */

/* Description: GPIO0~17 output value write 1 to set */

#define RTC_GPIO_OUT_DATA_W1TS    0x0003ffff
#define RTC_GPIO_OUT_DATA_W1TS_M  ((RTC_GPIO_OUT_DATA_W1TS_V) << \
                                   (RTC_GPIO_OUT_DATA_W1TS_S))
#define RTC_GPIO_OUT_DATA_W1TS_V  0x3ffff
#define RTC_GPIO_OUT_DATA_W1TS_S  14

#define RTC_GPIO_OUT_W1TC_REG     (DR_REG_RTCIO_BASE + 0x8)

/* RTC_GPIO_OUT_DATA_W1TC : WO ;bitpos:[31:14] ;default: 0 ; */

/* Description: GPIO0~17 output value write 1 to clear */

#define RTC_GPIO_OUT_DATA_W1TC    0x0003ffff
#define RTC_GPIO_OUT_DATA_W1TC_M  ((RTC_GPIO_OUT_DATA_W1TC_V) << \
                                   (RTC_GPIO_OUT_DATA_W1TC_S))
#define RTC_GPIO_OUT_DATA_W1TC_V  0x3ffff
#define RTC_GPIO_OUT_DATA_W1TC_S  14

#define RTC_GPIO_ENABLE_REG       (DR_REG_RTCIO_BASE + 0xc)

/* RTC_GPIO_ENABLE : R/W ;bitpos:[31:14] ;default: 0 ; */

/* Description: GPIO0~17 output enable */

#define RTC_GPIO_ENABLE           0x0003ffff
#define RTC_GPIO_ENABLE_M         ((RTC_GPIO_ENABLE_V) << \
                                   (RTC_GPIO_ENABLE_S))
#define RTC_GPIO_ENABLE_V         0x3ffff
#define RTC_GPIO_ENABLE_S         14

#define RTC_GPIO_ENABLE_W1TS_REG  (DR_REG_RTCIO_BASE + 0x10)

/* RTC_GPIO_ENABLE_W1TS : WO ;bitpos:[31:14] ;default: 0 ; */

/* Description: GPIO0~17 output enable write 1 to set */

#define RTC_GPIO_ENABLE_W1TS      0x0003ffff
#define RTC_GPIO_ENABLE_W1TS_M    ((RTC_GPIO_ENABLE_W1TS_V) << \
                                   (RTC_GPIO_ENABLE_W1TS_S))
#define RTC_GPIO_ENABLE_W1TS_V    0x3ffff
#define RTC_GPIO_ENABLE_W1TS_S    14

#define RTC_GPIO_ENABLE_W1TC_REG  (DR_REG_RTCIO_BASE + 0x14)

/* RTC_GPIO_ENABLE_W1TC : WO ;bitpos:[31:14] ;default: 0 ; */

/* Description: GPIO0~17 output enable write 1 to clear */

#define RTC_GPIO_ENABLE_W1TC      0x0003ffff
#define RTC_GPIO_ENABLE_W1TC_M    ((RTC_GPIO_ENABLE_W1TC_V) << \
                                   (RTC_GPIO_ENABLE_W1TC_S))
#define RTC_GPIO_ENABLE_W1TC_V    0x3ffff
#define RTC_GPIO_ENABLE_W1TC_S    14

#define RTC_GPIO_STATUS_REG       (DR_REG_RTCIO_BASE + 0x18)

/* RTC_GPIO_STATUS_INT : R/W ;bitpos:[31:14] ;default: 0 ; */

/* Description: GPIO0~17 interrupt status */

#define RTC_GPIO_STATUS_INT       0x0003ffff
#define RTC_GPIO_STATUS_INT_M     ((RTC_GPIO_STATUS_INT_V) << \
                                   (RTC_GPIO_STATUS_INT_S))
#define RTC_GPIO_STATUS_INT_V     0x3ffff
#define RTC_GPIO_STATUS_INT_S     14

#define RTC_GPIO_STATUS_W1TS_REG  (DR_REG_RTCIO_BASE + 0x1c)

/* RTC_GPIO_STATUS_INT_W1TS : WO ;bitpos:[31:14] ;default: 0 ; */

/* Description: GPIO0~17 interrupt status write 1 to set */

#define RTC_GPIO_STATUS_INT_W1TS    0x0003ffff
#define RTC_GPIO_STATUS_INT_W1TS_M  ((RTC_GPIO_STATUS_INT_W1TS_V) << \
                                     (RTC_GPIO_STATUS_INT_W1TS_S))
#define RTC_GPIO_STATUS_INT_W1TS_V  0x3ffff
#define RTC_GPIO_STATUS_INT_W1TS_S  14

#define RTC_GPIO_STATUS_W1TC_REG    (DR_REG_RTCIO_BASE + 0x20)

/* RTC_GPIO_STATUS_INT_W1TC : WO ;bitpos:[31:14] ;default: 0 ; */

/* Description: GPIO0~17 interrupt status write 1 to clear */

#define RTC_GPIO_STATUS_INT_W1TC    0x0003ffff
#define RTC_GPIO_STATUS_INT_W1TC_M  ((RTC_GPIO_STATUS_INT_W1TC_V) << \
                                     (RTC_GPIO_STATUS_INT_W1TC_S))
#define RTC_GPIO_STATUS_INT_W1TC_V  0x3ffff
#define RTC_GPIO_STATUS_INT_W1TC_S  14

#define RTC_GPIO_IN_REG             (DR_REG_RTCIO_BASE + 0x24)

/* RTC_GPIO_IN_NEXT : RO ;bitpos:[31:14] ;default:  ; */

/* Description: GPIO0~17 input value */

#define RTC_GPIO_IN_NEXT          0x0003ffff
#define RTC_GPIO_IN_NEXT_M        ((RTC_GPIO_IN_NEXT_V) << \
                                   (RTC_GPIO_IN_NEXT_S))
#define RTC_GPIO_IN_NEXT_V        0x3ffff
#define RTC_GPIO_IN_NEXT_S        14

#define RTC_GPIO_PIN0_REG         (DR_REG_RTCIO_BASE + 0x28)

/* RTC_GPIO_PIN0_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: 0 ; */

/* Description: GPIO wake up enable  only available in light sleep */

#define RTC_GPIO_PIN0_WAKEUP_ENABLE    (BIT(10))
#define RTC_GPIO_PIN0_WAKEUP_ENABLE_M  (BIT(10))
#define RTC_GPIO_PIN0_WAKEUP_ENABLE_V  0x1
#define RTC_GPIO_PIN0_WAKEUP_ENABLE_S  10

/* RTC_GPIO_PIN0_INT_TYPE : R/W ;bitpos:[9:7] ;default: 0 ; */

/* Description:
 * if set to 0: GPIO interrupt disable
 * if set to 1: rising edge trigger
 * if set to 2: falling edge trigger
 * if set to 3: any edge trigger
 * if set to 4: low level trigger
 * if set to 5: high level trigger
 */

#define RTC_GPIO_PIN0_INT_TYPE    0x00000007
#define RTC_GPIO_PIN0_INT_TYPE_M  ((RTC_GPIO_PIN0_INT_TYPE_V) << \
                                   (RTC_GPIO_PIN0_INT_TYPE_S))
#define RTC_GPIO_PIN0_INT_TYPE_V  0x7
#define RTC_GPIO_PIN0_INT_TYPE_S  7

/* RTC_GPIO_PIN0_PAD_DRIVER : R/W ;bitpos:[2] ;default: 0 ; */

/* Description:
 * if set to 0: normal output
 * if set to 1: open drain
 */

#define RTC_GPIO_PIN0_PAD_DRIVER    (BIT(2))
#define RTC_GPIO_PIN0_PAD_DRIVER_M  (BIT(2))
#define RTC_GPIO_PIN0_PAD_DRIVER_V  0x1
#define RTC_GPIO_PIN0_PAD_DRIVER_S  2

