apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_rtc_io.h
#define RTC_GPIO_PIN1_REG           (DR_REG_RTCIO_BASE + 0x2c)

/* RTC_GPIO_PIN1_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: 0 ; */

/* Description: GPIO wake up enable only available in light sleep */

#define RTC_GPIO_PIN1_WAKEUP_ENABLE    (BIT(10))
#define RTC_GPIO_PIN1_WAKEUP_ENABLE_M  (BIT(10))
#define RTC_GPIO_PIN1_WAKEUP_ENABLE_V  0x1
#define RTC_GPIO_PIN1_WAKEUP_ENABLE_S  10

/* RTC_GPIO_PIN1_INT_TYPE : R/W ;bitpos:[9:7] ;default: 0 ; */

/* Description:
 * if set to 0: GPIO interrupt disable
 * if set to 1: rising edge trigger
 * if set to 2: falling edge trigger
 * if set to 3: any edge trigger
 * if set to 4: low level trigger
 * if set to 5: high level trigger
 */

#define RTC_GPIO_PIN1_INT_TYPE    0x00000007
#define RTC_GPIO_PIN1_INT_TYPE_M  ((RTC_GPIO_PIN1_INT_TYPE_V) << \
                                   (RTC_GPIO_PIN1_INT_TYPE_S))
#define RTC_GPIO_PIN1_INT_TYPE_V  0x7
#define RTC_GPIO_PIN1_INT_TYPE_S  7

/* RTC_GPIO_PIN1_PAD_DRIVER : R/W ;bitpos:[2] ;default: 0 ; */

/* Description: if set to 0: normal output  if set to 1: open drain */

#define RTC_GPIO_PIN1_PAD_DRIVER    (BIT(2))
#define RTC_GPIO_PIN1_PAD_DRIVER_M  (BIT(2))
#define RTC_GPIO_PIN1_PAD_DRIVER_V  0x1
#define RTC_GPIO_PIN1_PAD_DRIVER_S  2

#define RTC_GPIO_PIN2_REG           (DR_REG_RTCIO_BASE + 0x30)

/* RTC_GPIO_PIN2_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: 0 ; */

/* Description: GPIO wake up enable only available in light sleep */

#define RTC_GPIO_PIN2_WAKEUP_ENABLE    (BIT(10))
#define RTC_GPIO_PIN2_WAKEUP_ENABLE_M  (BIT(10))
#define RTC_GPIO_PIN2_WAKEUP_ENABLE_V  0x1
#define RTC_GPIO_PIN2_WAKEUP_ENABLE_S  10

/* RTC_GPIO_PIN2_INT_TYPE : R/W ;bitpos:[9:7] ;default: 0 ; */

/* Description:
 * if set to 0: GPIO interrupt disable
 * if set to 1: rising edge trigger
 * if set to 2: falling edge trigger
 * if set to 3: any edge trigger
 * if set to 4: low level trigger
 * if set to 5: high level trigger
 */

#define RTC_GPIO_PIN2_INT_TYPE    0x00000007
#define RTC_GPIO_PIN2_INT_TYPE_M  ((RTC_GPIO_PIN2_INT_TYPE_V) << \
                                   (RTC_GPIO_PIN2_INT_TYPE_S))
#define RTC_GPIO_PIN2_INT_TYPE_V  0x7
#define RTC_GPIO_PIN2_INT_TYPE_S  7

/* RTC_GPIO_PIN2_PAD_DRIVER : R/W ;bitpos:[2] ;default: 0 ; */

/* Description: if set to 0: normal output  if set to 1: open drain */

#define RTC_GPIO_PIN2_PAD_DRIVER    (BIT(2))
#define RTC_GPIO_PIN2_PAD_DRIVER_M  (BIT(2))
#define RTC_GPIO_PIN2_PAD_DRIVER_V  0x1
#define RTC_GPIO_PIN2_PAD_DRIVER_S  2

#define RTC_GPIO_PIN3_REG           (DR_REG_RTCIO_BASE + 0x34)

/* RTC_GPIO_PIN3_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: 0 ; */

/* Description: GPIO wake up enable  only available in light sleep */

#define RTC_GPIO_PIN3_WAKEUP_ENABLE    (BIT(10))
#define RTC_GPIO_PIN3_WAKEUP_ENABLE_M  (BIT(10))
#define RTC_GPIO_PIN3_WAKEUP_ENABLE_V  0x1
#define RTC_GPIO_PIN3_WAKEUP_ENABLE_S  10

/* RTC_GPIO_PIN3_INT_TYPE : R/W ;bitpos:[9:7] ;default: 0 ; */

/* Description:
 * if set to 0: GPIO interrupt disable
 * if set to 1: rising edge trigger
 * if set to 2: falling edge trigger
 * if set to 3: any edge trigger
 * if set to 4: low level trigger
 * if set to 5: high level trigger
 */

#define RTC_GPIO_PIN3_INT_TYPE    0x00000007
#define RTC_GPIO_PIN3_INT_TYPE_M  ((RTC_GPIO_PIN3_INT_TYPE_V) << \
                                   (RTC_GPIO_PIN3_INT_TYPE_S))
#define RTC_GPIO_PIN3_INT_TYPE_V  0x7
#define RTC_GPIO_PIN3_INT_TYPE_S  7

/* RTC_GPIO_PIN3_PAD_DRIVER : R/W ;bitpos:[2] ;default: 0 ; */

/* Description: if set to 0: normal output  if set to 1: open drain */

#define RTC_GPIO_PIN3_PAD_DRIVER    (BIT(2))
#define RTC_GPIO_PIN3_PAD_DRIVER_M  (BIT(2))
#define RTC_GPIO_PIN3_PAD_DRIVER_V  0x1
#define RTC_GPIO_PIN3_PAD_DRIVER_S  2

#define RTC_GPIO_PIN4_REG          (DR_REG_RTCIO_BASE + 0x38)

/* RTC_GPIO_PIN4_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: 0 ; */

/* Description: GPIO wake up enable  only available in light sleep */

#define RTC_GPIO_PIN4_WAKEUP_ENABLE    (BIT(10))
#define RTC_GPIO_PIN4_WAKEUP_ENABLE_M  (BIT(10))
#define RTC_GPIO_PIN4_WAKEUP_ENABLE_V  0x1
#define RTC_GPIO_PIN4_WAKEUP_ENABLE_S  10

/* RTC_GPIO_PIN4_INT_TYPE : R/W ;bitpos:[9:7] ;default: 0 ; */

/* Description:
 * if set to 0: GPIO interrupt disable
 * if set to 1: rising edge trigger
 * if set to 2: falling edge trigger
 * if set to 3: any edge trigger
 * if set to 4: low level trigger
 * if set to 5: high level trigger
 */

#define RTC_GPIO_PIN4_INT_TYPE    0x00000007
#define RTC_GPIO_PIN4_INT_TYPE_M  ((RTC_GPIO_PIN4_INT_TYPE_V) << \
                                   (RTC_GPIO_PIN4_INT_TYPE_S))
#define RTC_GPIO_PIN4_INT_TYPE_V  0x7
#define RTC_GPIO_PIN4_INT_TYPE_S  7

/* RTC_GPIO_PIN4_PAD_DRIVER : R/W ;bitpos:[2] ;default: 0 ; */

/* Description: if set to 0: normal output  if set to 1: open drain */

#define RTC_GPIO_PIN4_PAD_DRIVER    (BIT(2))
#define RTC_GPIO_PIN4_PAD_DRIVER_M  (BIT(2))
#define RTC_GPIO_PIN4_PAD_DRIVER_V  0x1
#define RTC_GPIO_PIN4_PAD_DRIVER_S  2

#define RTC_GPIO_PIN5_REG           (DR_REG_RTCIO_BASE + 0x3c)

/* RTC_GPIO_PIN5_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: 0 ; */

/* Description: GPIO wake up enable  only available in light sleep */

#define RTC_GPIO_PIN5_WAKEUP_ENABLE    (BIT(10))
#define RTC_GPIO_PIN5_WAKEUP_ENABLE_M  (BIT(10))
#define RTC_GPIO_PIN5_WAKEUP_ENABLE_V  0x1
#define RTC_GPIO_PIN5_WAKEUP_ENABLE_S  10

/* RTC_GPIO_PIN5_INT_TYPE : R/W ;bitpos:[9:7] ;default: 0 ; */

/* Description:
 * if set to 0: GPIO interrupt disable
 * if set to 1: rising edge trigger
 * if set to 2: falling edge trigger
 * if set to 3: any edge trigger
 * if set to 4: low level trigger
 * if set to 5: high level trigger
 */

#define RTC_GPIO_PIN5_INT_TYPE    0x00000007
#define RTC_GPIO_PIN5_INT_TYPE_M  ((RTC_GPIO_PIN5_INT_TYPE_V) << \
                                   (RTC_GPIO_PIN5_INT_TYPE_S))
#define RTC_GPIO_PIN5_INT_TYPE_V  0x7
#define RTC_GPIO_PIN5_INT_TYPE_S  7

/* RTC_GPIO_PIN5_PAD_DRIVER : R/W ;bitpos:[2] ;default: 0 ; */

/* Description: if set to 0: normal output  if set to 1: open drain */

#define RTC_GPIO_PIN5_PAD_DRIVER    (BIT(2))
#define RTC_GPIO_PIN5_PAD_DRIVER_M  (BIT(2))
#define RTC_GPIO_PIN5_PAD_DRIVER_V  0x1
#define RTC_GPIO_PIN5_PAD_DRIVER_S  2

#define RTC_GPIO_PIN6_REG           (DR_REG_RTCIO_BASE + 0x40)

