apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_rtc_io.h
/* RTC_GPIO_PIN11_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: 0 ; */

/* Description: GPIO wake up enable  only available in light sleep */

#define RTC_GPIO_PIN11_WAKEUP_ENABLE    (BIT(10))
#define RTC_GPIO_PIN11_WAKEUP_ENABLE_M  (BIT(10))
#define RTC_GPIO_PIN11_WAKEUP_ENABLE_V  0x1
#define RTC_GPIO_PIN11_WAKEUP_ENABLE_S  10

/* RTC_GPIO_PIN11_INT_TYPE : R/W ;bitpos:[9:7] ;default: 0 ; */

/* Description:
 * if set to 0: GPIO interrupt disable
 * if set to 1: rising edge trigger
 * if set to 2: falling edge trigger
 * if set to 3: any edge trigger
 * if set to 4: low level trigger
 * if set to 5: high level trigger
 */

#define RTC_GPIO_PIN11_INT_TYPE    0x00000007
#define RTC_GPIO_PIN11_INT_TYPE_M  ((RTC_GPIO_PIN11_INT_TYPE_V) << \
                                    (RTC_GPIO_PIN11_INT_TYPE_S))
#define RTC_GPIO_PIN11_INT_TYPE_V  0x7
#define RTC_GPIO_PIN11_INT_TYPE_S  7

/* RTC_GPIO_PIN11_PAD_DRIVER : R/W ;bitpos:[2] ;default: 0 ; */

/* Description: if set to 0: normal output  if set to 1: open drain */

#define RTC_GPIO_PIN11_PAD_DRIVER    (BIT(2))
#define RTC_GPIO_PIN11_PAD_DRIVER_M  (BIT(2))
#define RTC_GPIO_PIN11_PAD_DRIVER_V  0x1
#define RTC_GPIO_PIN11_PAD_DRIVER_S  2

#define RTC_GPIO_PIN12_REG           (DR_REG_RTCIO_BASE + 0x58)

/* RTC_GPIO_PIN12_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: 0 ; */

/* Description: GPIO wake up enable only available in light sleep */

#define RTC_GPIO_PIN12_WAKEUP_ENABLE    (BIT(10))
#define RTC_GPIO_PIN12_WAKEUP_ENABLE_M  (BIT(10))
#define RTC_GPIO_PIN12_WAKEUP_ENABLE_V  0x1
#define RTC_GPIO_PIN12_WAKEUP_ENABLE_S  10

/* RTC_GPIO_PIN12_INT_TYPE : R/W ;bitpos:[9:7] ;default: 0 ; */

/* Description:
 * if set to 0: GPIO interrupt disable
 * if set to 1: rising edge trigger
 * if set to 2: falling edge trigger
 * if set to 3: any edge trigger
 * if set to 4: low level trigger
 * if set to 5: high level trigger
 */

#define RTC_GPIO_PIN12_INT_TYPE    0x00000007
#define RTC_GPIO_PIN12_INT_TYPE_M  ((RTC_GPIO_PIN12_INT_TYPE_V) << \
                                    (RTC_GPIO_PIN12_INT_TYPE_S))
#define RTC_GPIO_PIN12_INT_TYPE_V  0x7
#define RTC_GPIO_PIN12_INT_TYPE_S  7

/* RTC_GPIO_PIN12_PAD_DRIVER : R/W ;bitpos:[2] ;default: 0 ; */

/* Description: if set to 0: normal output  if set to 1: open drain */

#define RTC_GPIO_PIN12_PAD_DRIVER    (BIT(2))
#define RTC_GPIO_PIN12_PAD_DRIVER_M  (BIT(2))
#define RTC_GPIO_PIN12_PAD_DRIVER_V  0x1
#define RTC_GPIO_PIN12_PAD_DRIVER_S  2

#define RTC_GPIO_PIN13_REG          (DR_REG_RTCIO_BASE + 0x5c)

/* RTC_GPIO_PIN13_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: 0 ; */

/* Description: GPIO wake up enable  only available in light sleep */

#define RTC_GPIO_PIN13_WAKEUP_ENABLE    (BIT(10))
#define RTC_GPIO_PIN13_WAKEUP_ENABLE_M  (BIT(10))
#define RTC_GPIO_PIN13_WAKEUP_ENABLE_V  0x1
#define RTC_GPIO_PIN13_WAKEUP_ENABLE_S  10

/* RTC_GPIO_PIN13_INT_TYPE : R/W ;bitpos:[9:7] ;default: 0 ; */

/* Description:
 * if set to 0: GPIO interrupt disable
 * if set to 1: rising edge trigger
 * if set to 2: falling edge trigger
 * if set to 3: any edge trigger
 * if set to 4: low level trigger
 * if set to 5: high level trigger
 */

#define RTC_GPIO_PIN13_INT_TYPE    0x00000007
#define RTC_GPIO_PIN13_INT_TYPE_M  ((RTC_GPIO_PIN13_INT_TYPE_V) << \
                                    (RTC_GPIO_PIN13_INT_TYPE_S))
#define RTC_GPIO_PIN13_INT_TYPE_V  0x7
#define RTC_GPIO_PIN13_INT_TYPE_S  7

/* RTC_GPIO_PIN13_PAD_DRIVER : R/W ;bitpos:[2] ;default: 0 ; */

/* Description: if set to 0: normal output  if set to 1: open drain */

#define RTC_GPIO_PIN13_PAD_DRIVER    (BIT(2))
#define RTC_GPIO_PIN13_PAD_DRIVER_M  (BIT(2))
#define RTC_GPIO_PIN13_PAD_DRIVER_V  0x1
#define RTC_GPIO_PIN13_PAD_DRIVER_S  2

#define RTC_GPIO_PIN14_REG          (DR_REG_RTCIO_BASE + 0x60)

/* RTC_GPIO_PIN14_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: 0 ; */

/* Description: GPIO wake up enable  only available in light sleep */

#define RTC_GPIO_PIN14_WAKEUP_ENABLE    (BIT(10))
#define RTC_GPIO_PIN14_WAKEUP_ENABLE_M  (BIT(10))
#define RTC_GPIO_PIN14_WAKEUP_ENABLE_V  0x1
#define RTC_GPIO_PIN14_WAKEUP_ENABLE_S  10

/* RTC_GPIO_PIN14_INT_TYPE : R/W ;bitpos:[9:7] ;default: 0 ; */

/* Description:
 * if set to 0: GPIO interrupt disable
 * if set to 1: rising edge trigger
 * if set to 2: falling edge trigger
 * if set to 3: any edge trigger
 * if set to 4: low level trigger
 * if set to 5: high level trigger
 */

#define RTC_GPIO_PIN14_INT_TYPE    0x00000007
#define RTC_GPIO_PIN14_INT_TYPE_M  ((RTC_GPIO_PIN14_INT_TYPE_V) << \
                                    (RTC_GPIO_PIN14_INT_TYPE_S))
#define RTC_GPIO_PIN14_INT_TYPE_V  0x7
#define RTC_GPIO_PIN14_INT_TYPE_S  7

/* RTC_GPIO_PIN14_PAD_DRIVER : R/W ;bitpos:[2] ;default: 0 ; */

/* Description: if set to 0: normal output  if set to 1: open drain */

#define RTC_GPIO_PIN14_PAD_DRIVER    (BIT(2))
#define RTC_GPIO_PIN14_PAD_DRIVER_M  (BIT(2))
#define RTC_GPIO_PIN14_PAD_DRIVER_V  0x1
#define RTC_GPIO_PIN14_PAD_DRIVER_S  2

#define RTC_GPIO_PIN15_REG           (DR_REG_RTCIO_BASE + 0x64)

/* RTC_GPIO_PIN15_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: 0 ; */

/* Description: GPIO wake up enable  only available in light sleep */

#define RTC_GPIO_PIN15_WAKEUP_ENABLE    (BIT(10))
#define RTC_GPIO_PIN15_WAKEUP_ENABLE_M  (BIT(10))
#define RTC_GPIO_PIN15_WAKEUP_ENABLE_V  0x1
#define RTC_GPIO_PIN15_WAKEUP_ENABLE_S  10

/* RTC_GPIO_PIN15_INT_TYPE : R/W ;bitpos:[9:7] ;default: 0 ; */

/* Description:
 * if set to 0: GPIO interrupt disable
 * if set to 1: rising edge trigger
 * if set to 2: falling edge trigger
 * if set to 3: any edge trigger
 * if set to 4: low level trigger
 * if set to 5: high level trigger
 */

#define RTC_GPIO_PIN15_INT_TYPE    0x00000007
#define RTC_GPIO_PIN15_INT_TYPE_M  ((RTC_GPIO_PIN15_INT_TYPE_V) << \
                                    (RTC_GPIO_PIN15_INT_TYPE_S))
#define RTC_GPIO_PIN15_INT_TYPE_V  0x7
#define RTC_GPIO_PIN15_INT_TYPE_S  7

/* RTC_GPIO_PIN15_PAD_DRIVER : R/W ;bitpos:[2] ;default: 0 ; */

/* Description: if set to 0: normal output  if set to 1: open drain */

