apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_rtc_io.h
#define RTC_GPIO_PIN15_PAD_DRIVER    (BIT(2))
#define RTC_GPIO_PIN15_PAD_DRIVER_M  (BIT(2))
#define RTC_GPIO_PIN15_PAD_DRIVER_V  0x1
#define RTC_GPIO_PIN15_PAD_DRIVER_S  2

#define RTC_GPIO_PIN16_REG           (DR_REG_RTCIO_BASE + 0x68)

/* RTC_GPIO_PIN16_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: 0 ; */

/* Description: GPIO wake up enable  only available in light sleep */

#define RTC_GPIO_PIN16_WAKEUP_ENABLE    (BIT(10))
#define RTC_GPIO_PIN16_WAKEUP_ENABLE_M  (BIT(10))
#define RTC_GPIO_PIN16_WAKEUP_ENABLE_V  0x1
#define RTC_GPIO_PIN16_WAKEUP_ENABLE_S  10

/* RTC_GPIO_PIN16_INT_TYPE : R/W ;bitpos:[9:7] ;default: 0 ; */

/* Description:
 * if set to 0: GPIO interrupt disable
 * if set to 1: rising edge trigger
 * if set to 2: falling edge trigger
 * if set to 3: any edge trigger
 * if set to 4: low level trigger
 * if set to 5: high level trigger
 */

#define RTC_GPIO_PIN16_INT_TYPE    0x00000007
#define RTC_GPIO_PIN16_INT_TYPE_M  ((RTC_GPIO_PIN16_INT_TYPE_V) << \
                                    (RTC_GPIO_PIN16_INT_TYPE_S))
#define RTC_GPIO_PIN16_INT_TYPE_V  0x7
#define RTC_GPIO_PIN16_INT_TYPE_S  7

/* RTC_GPIO_PIN16_PAD_DRIVER : R/W ;bitpos:[2] ;default: 0 ; */

/* Description: if set to 0: normal output  if set to 1: open drain */

#define RTC_GPIO_PIN16_PAD_DRIVER    (BIT(2))
#define RTC_GPIO_PIN16_PAD_DRIVER_M  (BIT(2))
#define RTC_GPIO_PIN16_PAD_DRIVER_V  0x1
#define RTC_GPIO_PIN16_PAD_DRIVER_S  2

#define RTC_GPIO_PIN17_REG           (DR_REG_RTCIO_BASE + 0x6c)

/* RTC_GPIO_PIN17_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: 0 ; */

/* Description: GPIO wake up enable  only available in light sleep */

#define RTC_GPIO_PIN17_WAKEUP_ENABLE    (BIT(10))
#define RTC_GPIO_PIN17_WAKEUP_ENABLE_M  (BIT(10))
#define RTC_GPIO_PIN17_WAKEUP_ENABLE_V  0x1
#define RTC_GPIO_PIN17_WAKEUP_ENABLE_S  10

/* RTC_GPIO_PIN17_INT_TYPE : R/W ;bitpos:[9:7] ;default: 0 ; */

/* Description:
 * if set to 0: GPIO interrupt disable
 * if set to 1: rising edge trigger
 * if set to 2: falling edge trigger
 * if set to 3: any edge trigger
 * if set to 4: low level trigger
 * if set to 5: high level trigger
 */

#define RTC_GPIO_PIN17_INT_TYPE    0x00000007
#define RTC_GPIO_PIN17_INT_TYPE_M  ((RTC_GPIO_PIN17_INT_TYPE_V)<<(RTC_GPIO_PIN17_INT_TYPE_S))
#define RTC_GPIO_PIN17_INT_TYPE_V  0x7
#define RTC_GPIO_PIN17_INT_TYPE_S  7

/* RTC_GPIO_PIN17_PAD_DRIVER : R/W ;bitpos:[2] ;default: 0 ; */

/* Description: if set to 0: normal output  if set to 1: open drain */

#define RTC_GPIO_PIN17_PAD_DRIVER    (BIT(2))
#define RTC_GPIO_PIN17_PAD_DRIVER_M  (BIT(2))
#define RTC_GPIO_PIN17_PAD_DRIVER_V  0x1
#define RTC_GPIO_PIN17_PAD_DRIVER_S  2

#define RTC_IO_RTC_DEBUG_SEL_REG     (DR_REG_RTCIO_BASE + 0x70)

/* RTC_IO_DEBUG_12M_NO_GATING : R/W ;bitpos:[25] ;default: 1'd0 ; */

#define RTC_IO_DEBUG_12M_NO_GATING    (BIT(25))
#define RTC_IO_DEBUG_12M_NO_GATING_M  (BIT(25))
#define RTC_IO_DEBUG_12M_NO_GATING_V  0x1
#define RTC_IO_DEBUG_12M_NO_GATING_S  25

/* RTC_IO_DEBUG_SEL4 : R/W ;bitpos:[24:20] ;default: 5'd0 ; */

#define RTC_IO_DEBUG_SEL4    0x0000001f
#define RTC_IO_DEBUG_SEL4_M  ((RTC_IO_DEBUG_SEL4_V) << \
                              (RTC_IO_DEBUG_SEL4_S))
#define RTC_IO_DEBUG_SEL4_V  0x1f
#define RTC_IO_DEBUG_SEL4_S  20

/* RTC_IO_DEBUG_SEL3 : R/W ;bitpos:[19:15] ;default: 5'd0 ; */

#define RTC_IO_DEBUG_SEL3    0x0000001f
#define RTC_IO_DEBUG_SEL3_M  ((RTC_IO_DEBUG_SEL3_V) << \
                              (RTC_IO_DEBUG_SEL3_S))
#define RTC_IO_DEBUG_SEL3_V  0x1f
#define RTC_IO_DEBUG_SEL3_S  15

/* RTC_IO_DEBUG_SEL2 : R/W ;bitpos:[14:10] ;default: 5'd0 ; */

#define RTC_IO_DEBUG_SEL2    0x0000001f
#define RTC_IO_DEBUG_SEL2_M  ((RTC_IO_DEBUG_SEL2_V) << \
                              (RTC_IO_DEBUG_SEL2_S))
#define RTC_IO_DEBUG_SEL2_V  0x1f
#define RTC_IO_DEBUG_SEL2_S  10

/* RTC_IO_DEBUG_SEL1 : R/W ;bitpos:[9:5] ;default: 5'd0 ; */

#define RTC_IO_DEBUG_SEL1    0x0000001f
#define RTC_IO_DEBUG_SEL1_M  ((RTC_IO_DEBUG_SEL1_V) << (RTC_IO_DEBUG_SEL1_S))
#define RTC_IO_DEBUG_SEL1_V  0x1f
#define RTC_IO_DEBUG_SEL1_S  5

/* RTC_IO_DEBUG_SEL0 : R/W ;bitpos:[4:0] ;default: 5'd0 ; */

#define RTC_IO_DEBUG_SEL0          0x0000001f
#define RTC_IO_DEBUG_SEL0_M        ((RTC_IO_DEBUG_SEL0_V) << \
                                    (RTC_IO_DEBUG_SEL0_S))
#define RTC_IO_DEBUG_SEL0_V        0x1f
#define RTC_IO_DEBUG_SEL0_S        0
#define RTC_IO_DEBUG_SEL0_8M       1
#define RTC_IO_DEBUG_SEL0_32K_XTAL 4
#define RTC_IO_DEBUG_SEL0_150K_OSC 5

#define RTC_IO_DIG_PAD_HOLD_REG    (DR_REG_RTCIO_BASE + 0x74)

/* RTC_IO_DIG_PAD_HOLD : R/W ;bitpos:[31:0] ;default: 1'd0 ; */

/* Description: select the digital pad hold value. */

#define RTC_IO_DIG_PAD_HOLD    0xffffffff
#define RTC_IO_DIG_PAD_HOLD_M  ((RTC_IO_DIG_PAD_HOLD_V) << \
                                (RTC_IO_DIG_PAD_HOLD_S))
#define RTC_IO_DIG_PAD_HOLD_V  0xffffffff
#define RTC_IO_DIG_PAD_HOLD_S  0

#define RTC_IO_HALL_SENS_REG   (DR_REG_RTCIO_BASE + 0x78)

/* RTC_IO_XPD_HALL : R/W ;bitpos:[31] ;default: 1'd0 ; */

/* Description: Power on hall sensor and connect to VP and VN */

#define RTC_IO_XPD_HALL    (BIT(31))
#define RTC_IO_XPD_HALL_M  (BIT(31))
#define RTC_IO_XPD_HALL_V  0x1
#define RTC_IO_XPD_HALL_S  31

/* RTC_IO_HALL_PHASE : R/W ;bitpos:[30] ;default: 1'd0 ; */

/* Description: Reverse phase of hall sensor */

#define RTC_IO_HALL_PHASE    (BIT(30))
#define RTC_IO_HALL_PHASE_M  (BIT(30))
#define RTC_IO_HALL_PHASE_V  0x1
#define RTC_IO_HALL_PHASE_S  30

#define RTC_IO_SENSOR_PADS_REG    (DR_REG_RTCIO_BASE + 0x7c)

/* RTC_IO_SENSE1_HOLD : R/W ;bitpos:[31] ;default: 1'd0 ; */

/* Description: hold the current value of the output when setting the
 * hold to '1'
 */

#define RTC_IO_SENSE1_HOLD    (BIT(31))
#define RTC_IO_SENSE1_HOLD_M  (BIT(31))
#define RTC_IO_SENSE1_HOLD_V  0x1
#define RTC_IO_SENSE1_HOLD_S  31

/* RTC_IO_SENSE2_HOLD : R/W ;bitpos:[30] ;default: 1'd0 ; */

/* Description: hold the current value of the output when setting the
 * hold to '1'
 */

#define RTC_IO_SENSE2_HOLD    (BIT(30))
#define RTC_IO_SENSE2_HOLD_M  (BIT(30))
#define RTC_IO_SENSE2_HOLD_V  0x1
#define RTC_IO_SENSE2_HOLD_S  30

