apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_rtc_io.h
/* RTC_IO_XTL_EXT_CTR_SEL : R/W ;bitpos:[31:27] ;default: 5'd0 ; */

/* Description: select the external xtl power source
 * '0' select GPIO0
 * '1' select GPIO2 ... '17' select GPIO17
 */

#define RTC_IO_XTL_EXT_CTR_SEL    0x0000001f
#define RTC_IO_XTL_EXT_CTR_SEL_M  ((RTC_IO_XTL_EXT_CTR_SEL_V) << \
                                   (RTC_IO_XTL_EXT_CTR_SEL_S))
#define RTC_IO_XTL_EXT_CTR_SEL_V  0x1f
#define RTC_IO_XTL_EXT_CTR_SEL_S  27

#define RTC_IO_SAR_I2C_IO_REG     (DR_REG_RTCIO_BASE + 0xc4)

/* RTC_IO_SAR_I2C_SDA_SEL : R/W ;bitpos:[31:30] ;default: 2'd0 ; */

/* Description:
 * '0' using TOUCH_PAD[1] as i2c sda
 * '1' using TOUCH_PAD[3] as i2c sda
 */

#define RTC_IO_SAR_I2C_SDA_SEL    0x00000003
#define RTC_IO_SAR_I2C_SDA_SEL_M  ((RTC_IO_SAR_I2C_SDA_SEL_V) << \
                                   (RTC_IO_SAR_I2C_SDA_SEL_S))
#define RTC_IO_SAR_I2C_SDA_SEL_V  0x3
#define RTC_IO_SAR_I2C_SDA_SEL_S  30

/* RTC_IO_SAR_I2C_SCL_SEL : R/W ;bitpos:[29:28] ;default: 2'd0 ; */

/* Description:
 * '0' using TOUCH_PAD[0] as i2c clk
 * '1' using TOUCH_PAD[2] as i2c clk
 */

#define RTC_IO_SAR_I2C_SCL_SEL    0x00000003
#define RTC_IO_SAR_I2C_SCL_SEL_M  ((RTC_IO_SAR_I2C_SCL_SEL_V) << \
                                   (RTC_IO_SAR_I2C_SCL_SEL_S))
#define RTC_IO_SAR_I2C_SCL_SEL_V  0x3
#define RTC_IO_SAR_I2C_SCL_SEL_S  28

/* RTC_IO_SAR_DEBUG_BIT_SEL : R/W ;bitpos:[27:23] ;default: 5'h0 ; */

#define RTC_IO_SAR_DEBUG_BIT_SEL    0x0000001f
#define RTC_IO_SAR_DEBUG_BIT_SEL_M  ((RTC_IO_SAR_DEBUG_BIT_SEL_V) << \
                                     (RTC_IO_SAR_DEBUG_BIT_SEL_S))
#define RTC_IO_SAR_DEBUG_BIT_SEL_V  0x1f
#define RTC_IO_SAR_DEBUG_BIT_SEL_S  23

#define RTC_IO_DATE_REG             (DR_REG_RTCIO_BASE + 0xc8)

/* RTC_IO_IO_DATE : R/W ;bitpos:[27:0] ;default: 28'h1603160 ; */

/* Description: date */

#define RTC_IO_IO_DATE             0x0fffffff
#define RTC_IO_IO_DATE_M           ((RTC_IO_IO_DATE_V)<<(RTC_IO_IO_DATE_S))
#define RTC_IO_IO_DATE_V           0xfffffff
#define RTC_IO_IO_DATE_S           0
#define RTC_IO_RTC_IO_DATE_VERSION 0x1703160

#endif /* __ARCH_XTENSA_SRC_ESP32_HARDWARE_ESP32_RTC_IO_H */
